# SpacingRule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule Class
Members See Also
---
A rule for specifying a set of equidistant, parallel gridlines within a region.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SpacingRule : APIObject
```

Visual Basic
---
```text
Public Class SpacingRule _
	Inherits APIObject
```

Visual C++
---
```text
public ref class SpacingRule : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SpacingRule
# See Also
SpacingRule Members
Autodesk.Revit.DB Namespace